---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.GetBasicIEnumerator
source: html/8c02dbf4-7a04-f323-ccb8-7d69e10083af.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.